ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/USBFS0_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="USBFS0" HW_revision="1.0">
    <group id="USBFS0_GPRCM" name="USBFS0_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="USBFS0_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="USBFS0_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="USBFS0_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="ENABLE" description="Peripheral enable status" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="OFF" value="0x0" description="Peripheral is disabled"/>
                <bitenum id="ON" value="0x1" description="Peripheral is enabled"/>
            </bitfield>
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
            <bitfield id="SWENABLE" description="Software enable status. Shows if enabled via PWREN.ENABLE bit" begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="DISABLED" value="0x0" description="Not enabled via PWREN.ENABLE bit"/>
                <bitenum id="ENABLED" value="0x1" description="Enabled via PWREN.ENABLE bit"/>
            </bitfield>
        </register>
        </group>
    <group id="USBFS0_CPU_INT" name="USBFS0_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="USBFS0_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No bit is set means there is no pending interrupt request"/>
                <bitenum id="INTRTX" value="0x1" description="Endpoint 0 and the TX Endpoints interrupt"/>
                <bitenum id="INTRRX" value="0x2" description="RX Endpoints interrupt"/>
                <bitenum id="INTRUSB" value="0x3" description="USB Interrupts"/>
                <bitenum id="VUSBPWRDN" value="0x4" description="VUSB power down"/>
                <bitenum id="DMADONEARX" value="0x5" description="DMA-Done interrupt for Trigger USB-A-RX"/>
                <bitenum id="DMADONEATX" value="0x6" description="DMA-Done interrupt for Trigger USB-A-TX"/>
                <bitenum id="DMADONEBRX" value="0x7" description="DMA-Done interrupt for Trigger USB-B-RX"/>
                <bitenum id="DMADONEBTX" value="0x8" description="DMA-Done interrupt for Trigger USB-B-TX"/>
                <bitenum id="DMADONECRX" value="0x9" description="DMA-Done interrupt for Trigger USB-C-RX"/>
                <bitenum id="DMADONECTX" value="0xA" description="DMA-Done interrupt for Trigger USB-C-TX"/>
                <bitenum id="DMADONEDRX" value="0xB" description="DMA-Done interrupt for Trigger USB-D-RX"/>
                <bitenum id="DMADONEDTX" value="0xC" description="DMA-Done interrupt for Trigger USB-D-TX"/>
                <bitenum id="DMAPREARX" value="0xD" description="DMA-Pre interrupt for Trigger USB-A-RX"/>
                <bitenum id="DMAPREATX" value="0xE" description="DMA-Pre interrupt for Trigger USB-A-TX"/>
                <bitenum id="DMAPREBRX" value="0xF" description="DMA-Pre interrupt for Trigger USB-B-RX"/>
                <bitenum id="DMAPREBTX" value="0x10" description="DMA-Pre interrupt for Trigger USB-B-TX"/>
                <bitenum id="DMAPRECRX" value="0x11" description="DMA-Pre interrupt for Trigger USB-C-RX"/>
                <bitenum id="DMAPRECTX" value="0x12" description="DMA-Pre interrupt for Trigger USB-C-TX"/>
                <bitenum id="DMAPREDRX" value="0x13" description="DMA-Pre interrupt for Trigger USB-D-RX"/>
                <bitenum id="DMAPREDTX" value="0x14" description="DMA-Pre interrupt for Trigger USB-D-TX"/>
            </bitfield>
        </register>
        <register id="USBFS0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="INTRTX" description="Endpoint 0 and the TX Endpoints interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="INTRRX" description="RX Endpoints interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="INTRUSB" description="USB Interrupts" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="VUSBPWRDN" description="VUSB Power Down" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMADONEARX" description="DMA-Done interrupt for Trigger USB-A-RX" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMADONEATX" description="DMA-Done interrupt for Trigger USB-A-TX" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMADONEBRX" description="DMA-Done interrupt for Trigger USB-B-RX" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMADONEBTX" description="DMA-Done interrupt for Trigger USB-B-TX" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMADONECRX" description="DMA-Done interrupt for Trigger USB-C-RX" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMADONECTX" description="DMA-Done interrupt for Trigger USB-C-TX" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMADONEDRX" description="DMA-Done interrupt for Trigger USB-D-RX" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMADONEDTX" description="DMA-Done interrupt for Trigger USB-D-TX" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMAPREARX" description="DMA-Pre interrupt for Trigger USB-A-RX" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMAPREATX" description="DMA-Pre interrupt for Trigger USB-A-TX" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMAPREBRX" description="DMA-Pre interrupt for Trigger USB-B-RX" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMAPREBTX" description="DMA-Pre interrupt for Trigger USB-B-TX" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMAPRECRX" description="DMA-Pre interrupt for Trigger USB-C-RX" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMAPRECTX" description="DMA-Pre interrupt for Trigger USB-C-TX" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMAPREDRX" description="DMA-Pre interrupt for Trigger USB-D-RX" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
            <bitfield id="DMAPREDTX" description="DMA-Pre interrupt for Trigger USB-D-TX" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt Disabled."/>
                <bitenum id="SET" value="0x1" description="Interrupt Enabled."/>
            </bitfield>
        </register>
        <register id="USBFS0_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="INTRTX" description="Endpoint 0 and the TX Endpoints interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="INTRRX" description="RX Endpoints interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="INTRUSB" description="USB Interrupts" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="VUSBPWRDN" description="VUSB Power Down" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEARX" description="DMA-Done interrupt for Trigger USB-A-RX" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEATX" description="DMA-Done interrupt for Trigger USB-A-TX" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEBRX" description="DMA-Done interrupt for Trigger USB-B-RX" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEBTX" description="DMA-Done interrupt for Trigger USB-B-TX" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONECRX" description="DMA-Done interrupt for Trigger USB-C-RX" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONECTX" description="DMA-Done interrupt for Trigger USB-C-TX" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEDRX" description="DMA-Done interrupt for Trigger USB-D-RX" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEDTX" description="DMA-Done interrupt for Trigger USB-D-TX" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREARX" description="DMA-Pre interrupt for Trigger USB-A-RX" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREATX" description="DMA-Pre interrupt for Trigger USB-A-TX" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREBRX" description="DMA-Pre interrupt for Trigger USB-B-RX" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREBTX" description="DMA-Pre interrupt for Trigger USB-B-TX" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPRECRX" description="DMA-Pre interrupt for Trigger USB-C-RX" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPRECTX" description="DMA-Pre interrupt for Trigger USB-C-TX" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREDRX" description="DMA-Pre interrupt for Trigger USB-D-RX" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREDTX" description="DMA-Pre interrupt for Trigger USB-D-TX" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
