ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/USBFS0_1.0.xml
        <register id="USBFS0_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="INTRTX" description="Endpoint 0 and the TX Endpoints interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="INTRRX" description="RX Endpoints interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="INTRUSB" description="USB Interrupts" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="VUSBPWRDN" description="VUSB Power Down" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEARX" description="DMA-Done interrupt for Trigger USB-A-RX" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEATX" description="DMA-Done interrupt for Trigger USB-A-TX" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEBRX" description="DMA-Done interrupt for Trigger USB-B-RX" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEBTX" description="DMA-Done interrupt for Trigger USB-B-TX" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONECRX" description="DMA-Done interrupt for Trigger USB-C-RX" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONECTX" description="DMA-Done interrupt for Trigger USB-C-TX" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEDRX" description="DMA-Done interrupt for Trigger USB-D-RX" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMADONEDTX" description="DMA-Done interrupt for Trigger USB-D-TX" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREARX" description="DMA-Pre interrupt for Trigger USB-A-RX" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREATX" description="DMA-Pre interrupt for Trigger USB-A-TX" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREBRX" description="DMA-Pre interrupt for Trigger USB-B-RX" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREBTX" description="DMA-Pre interrupt for Trigger USB-B-TX" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPRECRX" description="DMA-Pre interrupt for Trigger USB-C-RX" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPRECTX" description="DMA-Pre interrupt for Trigger USB-C-TX" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREDRX" description="DMA-Pre interrupt for Trigger USB-D-RX" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMAPREDTX" description="DMA-Pre interrupt for Trigger USB-D-TX" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="USBFS0_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="INTRTX" description="Endpoint 0 and the TX Endpoints interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="INTRRX" description="RX Endpoints interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="INTRUSB" description="USB Interrupts" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="VUSBPWRDN" description="VUSB Power Down" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMADONEARX" description="DMA-Done interrupt for Trigger USB-A-RX" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMADONEATX" description="DMA-Done interrupt for Trigger USB-A-TX" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMADONEBRX" description="DMA-Done interrupt for Trigger USB-B-RX" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMADONEBTX" description="DMA-Done interrupt for Trigger USB-B-TX" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMADONECRX" description="DMA-Done interrupt for Trigger USB-C-RX" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMADONECTX" description="DMA-Done interrupt for Trigger USB-C-TX" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMADONEDRX" description="DMA-Done interrupt for Trigger USB-D-RX" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMADONEDTX" description="DMA-Done interrupt for Trigger USB-D-TX" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMAPREARX" description="DMA-Pre interrupt for Trigger USB-A-RX" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMAPREATX" description="DMA-Pre interrupt for Trigger USB-A-TX" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMAPREBRX" description="DMA-Pre interrupt for Trigger USB-B-RX" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMAPREBTX" description="DMA-Pre interrupt for Trigger USB-B-TX" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMAPRECRX" description="DMA-Pre interrupt for Trigger USB-C-RX" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMAPRECTX" description="DMA-Pre interrupt for Trigger USB-C-TX" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMAPREDRX" description="DMA-Pre interrupt for Trigger USB-D-RX" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
            <bitfield id="DMAPREDTX" description="DMA-Pre interrupt for Trigger USB-D-TX" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has No Effect"/>
                <bitenum id="SET" value="0x1" description="Write 1 to set the interrupt"/>
            </bitfield>
        </register>
