ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/USBFS0_1.0.xml
        </group>
    <register id="USBFS0_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="EVT0_CFG" description="Event line mode select for event corresponding to (IPSTANDARD.INT_EVENT)(0)" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="USBFS0_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="USBFS0_USBMODE" width="32" offset="0x1100" description="USB mode control">
        <bitfield id="HOST" description="USB is configured as HOST mode" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="USB is configured as DEVICE or HOST."/>
            <bitenum id="ENABLE" value="0x1" description="USB is configured as HOST"/>
        </bitfield>
        <bitfield id="DEVICEONLY" description="USB is configured as DEVICE_ONLY mode" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="USB is configured as DEVICE or HOST."/>
            <bitenum id="ENABLE" value="0x1" description="USB is configured as DEVICE only mode."/>
        </bitfield>
        <bitfield id="PHYMODE" description="USB PHY mode.  Defines whether DP/DM pins are controled by USB module or IOMUX/GPIO module." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="GPIO" value="0x0" description="The DP/DM pins are assighed to IOMUX/GPIO module,"/>
            <bitenum id="USB" value="0x1" description="The DP/DM pins are assighed to USB module."/>
        </bitfield>
    </register>
    <register id="USBFS0_USBMONITOR" width="32" offset="0x1104" description="USB Clock Control Register">
        <bitfield id="VUSBEN" description="Enable the 1/3 resistor divider for VUSB supply. Set this bit to monitor the VUSB supply with the ADC." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="VUSB monitor disabled"/>
            <bitenum id="ENABLE" value="0x1" description="VUSB monitor enabled"/>
        </bitfield>
    </register>
    <register id="USBFS0_USBDMASEL" width="32" offset="0x1108" description="USB DMA trigger select">
        <bitfield id="TRIGARX" description="TRIG A RX select specifies the RX mapping of the USB endpoint on DMA trigger USB-A-RX" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Disabled"/>
            <bitenum id="EP1" value="0x1" description="Endpoint 1"/>
            <bitenum id="EP2" value="0x2" description="Endpoint 2"/>
            <bitenum id="EP3" value="0x3" description="Endpoint 3"/>
            <bitenum id="EP4" value="0x4" description="Endpoint 4"/>
            <bitenum id="EP5" value="0x5" description="Endpoint 5"/>
            <bitenum id="EP6" value="0x6" description="Endpoint 6"/>
            <bitenum id="EP7" value="0x7" description="Endpoint 7"/>
        </bitfield>
        <bitfield id="TRIGATX" description="TRIG A TX select specifies the TX mapping of the USB endpoint on DMA  trigger USB-A-TX" begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Disabled"/>
            <bitenum id="EP1" value="0x1" description="Endpoint 1"/>
            <bitenum id="EP2" value="0x2" description="Endpoint 2"/>
            <bitenum id="EP3" value="0x3" description="Endpoint 3"/>
            <bitenum id="EP4" value="0x4" description="Endpoint 4"/>
            <bitenum id="EP5" value="0x5" description="Endpoint 5"/>
            <bitenum id="EP6" value="0x6" description="Endpoint 6"/>
            <bitenum id="EP7" value="0x7" description="Endpoint 7"/>
        </bitfield>
        <bitfield id="TRIGBRX" description="TRIG B RX select specifies the RX mapping of the USB endpoint on DMA  trigger USB-B-RX" begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Disabled"/>
            <bitenum id="EP1" value="0x1" description="Endpoint 1"/>
            <bitenum id="EP2" value="0x2" description="Endpoint 2"/>
            <bitenum id="EP3" value="0x3" description="Endpoint 3"/>
            <bitenum id="EP4" value="0x4" description="Endpoint 4"/>
            <bitenum id="EP5" value="0x5" description="Endpoint 5"/>
            <bitenum id="EP6" value="0x6" description="Endpoint 6"/>
            <bitenum id="EP7" value="0x7" description="Endpoint 7"/>
        </bitfield>
        <bitfield id="TRIGBTX" description="TRIG B TX select specifies the TX mapping of the USB endpoint on DMA  trigger USB-B-TX" begin="14" end="12" width="3" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Disabled"/>
            <bitenum id="EP1" value="0x1" description="Endpoint 1"/>
            <bitenum id="EP2" value="0x2" description="Endpoint 2"/>
            <bitenum id="EP3" value="0x3" description="Endpoint 3"/>
            <bitenum id="EP4" value="0x4" description="Endpoint 4"/>
            <bitenum id="EP5" value="0x5" description="Endpoint 5"/>
            <bitenum id="EP6" value="0x6" description="Endpoint 6"/>
            <bitenum id="EP7" value="0x7" description="Endpoint 7"/>
        </bitfield>
        <bitfield id="TRIGCRX" description="TRIG C RX select specifies the RX mapping of the USB endpoint on DMA  trigger USB-C-RX" begin="18" end="16" width="3" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Disabled"/>
            <bitenum id="EP1" value="0x1" description="Endpoint 1"/>
            <bitenum id="EP2" value="0x2" description="Endpoint 2"/>
            <bitenum id="EP3" value="0x3" description="Endpoint 3"/>
            <bitenum id="EP4" value="0x4" description="Endpoint 4"/>
            <bitenum id="EP5" value="0x5" description="Endpoint 5"/>
            <bitenum id="EP6" value="0x6" description="Endpoint 6"/>
            <bitenum id="EP7" value="0x7" description="Endpoint 7"/>
        </bitfield>
        <bitfield id="TRIGCTX" description="TRIG C TX select specifies the TX mapping of the USB endpoint on DMA  trigger USB-C-TX" begin="22" end="20" width="3" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Disabled"/>
            <bitenum id="EP1" value="0x1" description="Endpoint 1"/>
            <bitenum id="EP2" value="0x2" description="Endpoint 2"/>
            <bitenum id="EP3" value="0x3" description="Endpoint 3"/>
            <bitenum id="EP4" value="0x4" description="Endpoint 4"/>
            <bitenum id="EP5" value="0x5" description="Endpoint 5"/>
            <bitenum id="EP6" value="0x6" description="Endpoint 6"/>
            <bitenum id="EP7" value="0x7" description="Endpoint 7"/>
        </bitfield>
        <bitfield id="TRIGDRX" description="TRIG D RX select specifies the RX mapping of the USB endpoint on DMA  trigger USB-D-RX" begin="26" end="24" width="3" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Disabled"/>
            <bitenum id="EP1" value="0x1" description="Endpoint 1"/>
            <bitenum id="EP2" value="0x2" description="Endpoint 2"/>
            <bitenum id="EP3" value="0x3" description="Endpoint 3"/>
            <bitenum id="EP4" value="0x4" description="Endpoint 4"/>
            <bitenum id="EP5" value="0x5" description="Endpoint 5"/>
            <bitenum id="EP6" value="0x6" description="Endpoint 6"/>
            <bitenum id="EP7" value="0x7" description="Endpoint 7"/>
        </bitfield>
        <bitfield id="TRIGDTX" description="TRIG D TX select specifies the TX mapping of the USB endpoint on DMA  trigger USB-D-TX" begin="30" end="28" width="3" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Disabled"/>
            <bitenum id="EP1" value="0x1" description="Endpoint 1"/>
            <bitenum id="EP2" value="0x2" description="Endpoint 2"/>
            <bitenum id="EP3" value="0x3" description="Endpoint 3"/>
            <bitenum id="EP4" value="0x4" description="Endpoint 4"/>
            <bitenum id="EP5" value="0x5" description="Endpoint 5"/>
            <bitenum id="EP6" value="0x6" description="Endpoint 6"/>
            <bitenum id="EP7" value="0x7" description="Endpoint 7"/>
        </bitfield>
    </register>
    <register id="USBFS0_FADDR" width="8" offset="0x2000" description="USB Device Functional Address">
        <bitfield id="FUNCADDR" description="FAddr is an 8-bit register that should be written with the 7-bit address of the peripheral part of the transaction.
When the USB module is being used in Peripheral mode (DevCtl.D2=0), this register should be written with the address received through a SET_ADDRESS command, which will then be used for decoding the function address in subsequent token packets.
Notes: Peripheral Mode Only!!" begin="6" end="0" width="7" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="USBFS0_POWER" width="8" offset="0x2001" description="USB Power Control">
        <bitfield id="ENSUSPENDM" description="Set by the CPU to enable the Suspend mode for the USB PHY." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="USB PHY is powered"/>
            <bitenum id="ENABLE" value="0x1" description="Powers down the internal USB PHY."/>
        </bitfield>
        <bitfield id="SUSPEND" description="In Host mode, this bit is set by the CPU to enter Suspend mode.
In Peripheral mode, this bit is set on entry into Suspend mode. It is cleared when the CPU reads the interrupt register, or sets the Resume bit." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Ends SUSPEND signaling"/>
            <bitenum id="ENABLE" value="0x1" description="Enables SUSPEND signaling"/>
        </bitfield>
        <bitfield id="RESUME" description="Set by the CPU to generate Resume signaling when the device is in Suspend mode. 
In Peripheral mode, the CPU should clear this bit after 10 ms (a maximum of 15 ms), to end Resume signaling. 
In Host mode, the CPU should clear this bit after 20 ms." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Ends RESUME signaling on the bus."/>
            <bitenum id="ENABLE" value="0x1" description="Enables RESUME signaling when the Device is in SUSPEND mode."/>
        </bitfield>
        <bitfield id="RESET" description="This bit is set when Reset signaling is present on the bus. 
Note: This bit is Read/Write from the CPU in Host Mode but Read-Only in Peripheral Mode." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Ends RESET signaling on the bus."/>
            <bitenum id="ENABLE" value="0x1" description="Enables RESET signaling on the bus."/>
        </bitfield>
        <bitfield id="SOFT_CONN" description="Soft Connect/Disconnect feature.
The USB D+/D- lines are enabled when this bit is set by the CPU and tri-stated when this bit is cleared by the CPU. 
Note: Only valid in Peripheral Mode." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="TRISTATE" value="0x0" description="The USB D+/D- lines are tri-stated."/>
            <bitenum id="ENABLE" value="0x1" description="The USB D+/D- lines are enabled."/>
        </bitfield>
        <bitfield id="ISOUP" description="Isochronous Update.
When set by the CPU, the USB module will wait for an SOF token from the time TXRDY bit is set in the USBTXCSRLn before sending the packet. If an IN token is received before an SOF token, then a zero length data packet will be sent. 
Note: Only valid in Peripheral Mode. Also, this bit only affects endpoints performing Isochronous transfers." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="WAIT_SOF" value="0x1" description="The USB controller waits for an SOF token."/>
        </bitfield>
    </register>
    <register id="USBFS0_TXIS" width="16" offset="0x2002" description="USB Transmit Interrupt Status">
        <bitfield id="EP0" description="Transmit Endpoint 0 Interrupt" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 0 transmit and receive interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP1" description="Transmit Endpoint 1 Interrupt" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 1 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP2" description="Transmit Endpoint 2 Interrupt" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 2 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP3" description="Transmit Endpoint 3 Interrupt" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 3 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP4" description="Transmit Endpoint 4 Interrupt" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 4 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP5" description="Transmit Endpoint 5 Interrupt" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 5 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP6" description="Transmit Endpoint 6 Interrupt" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 6 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP7" description="Transmit Endpoint 7 Interrupt" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 7 transmit interrupt is asserted."/>
        </bitfield>
    </register>
    <register id="USBFS0_RXIS" width="16" offset="0x2004" description="USB Receive Interrupt Status">
        <bitfield id="EP1" description="Recieve Endpoint 1 Interrupt" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 1 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP2" description="Recieve Endpoint 2 Interrupt" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 2 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP3" description="Recieve Endpoint 3 Interrupt" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 3 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP4" description="Recieve Endpoint 4 Interrupt" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 4 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP5" description="Recieve Endpoint 5 Interrupt" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 5 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP6" description="Recieve Endpoint 6 Interrupt" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 6 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP7" description="Recieve Endpoint 7 Interrupt" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 7 transmit interrupt is asserted."/>
        </bitfield>
    </register>
    <register id="USBFS0_TXIE" width="16" offset="0x2006" description="USB Transmit Interrupt Enable">
        <bitfield id="EP0" description="Transmit Endpoint 0 Interrupt Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The EP0 transmit and receive interrupt is suppressed and not sent to the interupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the EP0 bit in the USBTXIS register is set."/>
        </bitfield>
        <bitfield id="EP1" description="Transmit Endpoint 1 Interrupt Enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The EP1 transmit interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the EP1 bit in the USBTXIS register is set."/>
        </bitfield>
        <bitfield id="EP2" description="Transmit Endpoint 2 Interrupt Enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The EP2 transmit interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the EP2 bit in the USBTXIS register is set."/>
        </bitfield>
        <bitfield id="EP3" description="Transmit Endpoint 3 Interrupt Enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The EP3 transmit interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the EP3 bit in the USBTXIS register is set."/>
        </bitfield>
        <bitfield id="EP4" description="Transmit Endpoint 4 Interrupt Enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The EP4 transmit interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the EP4 bit in the USBTXIS register is set."/>
        </bitfield>
        <bitfield id="EP5" description="Transmit Endpoint 5 Interrupt Enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The EP5 transmit interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the EP5 bit in the USBTXIS register is set."/>
        </bitfield>
        <bitfield id="EP6" description="Transmit Endpoint 6 Interrupt Enable" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The EP6 transmit interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the EP6 bit in the USBTXIS register is set."/>
        </bitfield>
        <bitfield id="EP7" description="Transmit Endpoint 7 Interrupt Enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The EP7 transmit interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the EP7 bit in the USBTXIS register is set."/>
        </bitfield>
    </register>
