ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/USBFS0_1.0.xml
    <register id="USBFS0_RXIE" width="16" offset="0x2008" description="USB Receive Interrupt Enable">
        <bitfield id="EP1" description="Recieve Endpoint 1 Interrupt Enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 1 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP2" description="Recieve Endpoint 2 Interrupt Enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 2 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP3" description="Recieve Endpoint 3 Interrupt Enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 3 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP4" description="Recieve Endpoint 4 Interrupt Enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 4 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP5" description="Recieve Endpoint 5 Interrupt Enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 5 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP6" description="Recieve Endpoint 6 Interrupt Enable" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 6 transmit interrupt is asserted."/>
        </bitfield>
        <bitfield id="EP7" description="Recieve Endpoint 7 Interrupt Enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The Endpoint 7 transmit interrupt is asserted."/>
        </bitfield>
    </register>
    <register id="USBFS0_USBIS" width="8" offset="0x200A" description="USB General Interrupt Status">
        <bitfield id="SUSPEND" description="Set when Suspend signaling is detected on the bus.
Note: Only valid in Peripheral mode." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="SUSPEND signaling has been detected on the bus."/>
        </bitfield>
        <bitfield id="RESUME" description="Set when Resume signaling is detected on the bus while the USB controller is in Suspend mode." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="RESUME signaling has been detected on the bus."/>
        </bitfield>
        <bitfield id="RESETBABBLE" description="Device mode - RESET: Set in Peripheral mode when Reset signaling is detected on the bus.
Host mode - BABBLE: Set in Host mode when babble is detected. Note: Only active after first SOF has been sent." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="RESET / BABBLE signaling has been detected on the bus."/>
        </bitfield>
        <bitfield id="SOF" description="Start of frame" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="A new frame has started."/>
        </bitfield>
        <bitfield id="CONN" description="Set when a device connection is detected. 
Note: Only valid in Host mode. Valid at all transaction speeds." begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The device has detected a connection to the host."/>
        </bitfield>
        <bitfield id="DISCON" description="Set in Host mode when a device disconnect is detected.
Set in Peripheral mode when a session ends. Valid at all transaction speeds." begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="NO_INT" value="0x0" description="No interrupt"/>
            <bitenum id="INT" value="0x1" description="The device has been disconnected from the host."/>
        </bitfield>
    </register>
    <register id="USBFS0_USBIE" width="8" offset="0x200B" description="USB General Interrupt Enable">
        <bitfield id="SUSPEND" description="Interrupt enable for SUSPEND signaling detected.
Note: Only valid in Peripheral mode." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The SUSPEND interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the DISCON bit in the USBIS register is set."/>
        </bitfield>
        <bitfield id="RESUME" description="Interrupt enable for RESUME signaling detected." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The RESUME interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the RESUME bit in the USBIS register is set."/>
        </bitfield>
        <bitfield id="RESETBABBLE" description="Interrupt enable for RESET/BABBLE signaling detected." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DSIABLE" value="0x0" description="The RESET interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the RESET bit in the USBIS register is set."/>
        </bitfield>
        <bitfield id="SOF" description="Interrupt enable for Start of frame." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The SOF interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the SOF bit in the USBIS register is set."/>
        </bitfield>
        <bitfield id="CONN" description="Interrupt enable for connect detected.
Note: Only valid in Host mode. Valid at all transaction speeds." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The CONN interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the CONN bit in the USBIS register is set."/>
        </bitfield>
        <bitfield id="DISCON" description="Interrupt enable for session disconnect." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The DISCON interrupt is suppressed and not sent to the interrupt controller."/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt is sent to the interrupt controller when the DISCON bit in the USBIS register is set."/>
        </bitfield>
    </register>
