ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/USBFS0_1.0.xml
    <register id="USBFS0_FRAME" width="16" offset="0x200C" description="USB Last Received Frame Number">
        <bitfield id="FRAME" description="Frame Number" begin="10" end="0" width="11" rwaccess="R">
        </bitfield>
    </register>
    <register id="USBFS0_EPINDEX" width="8" offset="0x200E" description="USB Endpoint Index">
        <bitfield id="EPIDX" description="Endpoint Index.  #br#This bit field configures which endpoint is accessed when reading or writing to one of the USB controller's indexed registers. A value of 0x0 corresponds to Endpoint 0 and a value of 0xF corresponds to Endpoint 15." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="EP0" value="0x0" description="Select EP0 as indexed register"/>
            <bitenum id="EP1" value="0x1" description="Select EP1 as indexed register"/>
            <bitenum id="EP2" value="0x2" description="Select EP2 as indexed register"/>
            <bitenum id="EP3" value="0x3" description="Select EP3 as indexed register"/>
            <bitenum id="EP4" value="0x4" description="Select EP4 as indexed register"/>
            <bitenum id="EP5" value="0x5" description="Select EP5 as indexed register"/>
            <bitenum id="EP6" value="0x6" description="Select EP6 as indexed register"/>
            <bitenum id="EP7" value="0x7" description="Select EP7 as indexed register"/>
        </bitfield>
    </register>
    <register id="USBFS0_TESTMODE" width="8" offset="0x200F" description="USB Test Mode">
        <bitfield id="FORCEFS" description="Force Full Speed Upon Reset.
The CPU sets this bit either in conjunction with bit 7 (FORCEH) or to force the USB controller into Full-speed mode when it receives a USB reset." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="The USB controller operates at Low Speed."/>
            <bitenum id="FULL" value="0x1" description="Forces the USB controller into Full-Speed mode upon receiving a USB RESET."/>
        </bitfield>
        <bitfield id="FIFOACC" description="FIFO Access.
The CPU sets this bit to transfer the packet in the Endpoint 0 TX FIFO to the Endpoint 0 Rx FIFO. 
Note: It is cleared automatically." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="EFFECT" value="0x1" description="Transfers the packet in the endpoint 0 transmit FIFO to the endpoint 0 receive FIFO."/>
        </bitfield>
        <bitfield id="FORCEH" description="Force Host Mode.
The CPU sets this bit to instruct the core to enter Host mode when the Session bit is set, regardless of whether it is connected to any peripheral. The state of the CID input, HostDisconnect and LineState signals are ignored. The core will then remain in Host mode until the Session bit is cleared, even if a device is disconnected, and if the Force_Host bit remains set, will re-enter Host mode the next time the Session bit is set.
While in this mode, status of the bus connection may be read using the DEV bit of the USBDEVCTL register. The operating speed is determined from the FORCEFS bit." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="EFFECT" value="0x1" description="Forces the USB controller to enter Host mode when the SESSION bit is set, regardless ofwhether the USB controller is connected to any peripheral. The state of the USB0DP and USB0DM signals is ignored. The USB controller then remains in Host mode until the SESSION #br#bit is cleared, even if a Device is disconnected. If the FORCEH bit remains set, the USB controller re-enters Host mode the next time the SESSION bit is set."/>
        </bitfield>
    </register>
    <register id="USBFS0_IDXTXMAXP" width="16" offset="0x2010" description="Indexed TXMAP">
    </register>
    <register id="USBFS0_IDXTXCSRL" width="8" offset="0x2012" description="Indexed TXCSRL">
    </register>
    <register id="USBFS0_IDXTXCSRH" width="8" offset="0x2013" description="Indexed TXCSRH">
    </register>
    <register id="USBFS0_IDXRXMAXP" width="16" offset="0x2014" description="Indexed RXMAXP">
    </register>
    <register id="USBFS0_IDXRXCSRL" width="8" offset="0x2016" description="Indexed RXCSRL">
    </register>
    <register id="USBFS0_IDXRXCSRH" width="8" offset="0x2017" description="Indexed RXCSRH">
    </register>
    <register id="USBFS0_IDXRXCOUNT" width="16" offset="0x2018" description="Indexed RXCOUNT">
    </register>
    <register id="USBFS0_IDXTXTYPE" width="8" offset="0x201A" description="Indexed TXTYPE">
    </register>
    <register id="USBFS0_IDXTXINTERVAL" width="8" offset="0x201B" description="Indexed TXINTERVAL">
    </register>
    <register id="USBFS0_IDXRXTYPE" width="8" offset="0x201C" description="Indexed RXTYPE">
    </register>
    <register id="USBFS0_IDXRXINTERVAL" width="8" offset="0x201D" description="Indexed RXINTERVAL">
    </register>
    <register id="USBFS0_IDXFIFOSZ" width="8" offset="0x201F" description="Indexed FIFOSZ">
    </register>
    <register id="USBFS0_FIFO" width="32" offset="0x2020" instances="16" instaddr="0x4" description="USB FIFO Endpoint [n]">
    </register>
    <register id="USBFS0_DEVCTL" width="8" offset="0x2060" description="USB Device Control">
        <bitfield id="SESSION" description="Session Start/End.
Host mode: This bit is set or cleared by the CPU to start or end a session.
Device mode: This bit is set/cleared by the USB controller when a session starts/ends. It is also set by the CPU to initiate the Session Request Protocol. When the USB controller is in Suspend mode, the bit may be cleared by the CPU to perform a software disconnect. 
Note: Clearing this bit when the core is not suspended will result in undefined behavior." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLEAR" value="0x0" description="When operating as a Host: #br#When cleared by software, this bit ends a session. #br# #br#When operating as a Device: #br#The USB controller has ended a session. When the USB controller is in SUSPEND mode, this bit may be cleared by software to perform a software disconnect."/>
            <bitenum id="SET" value="0x1" description="When operating as a Host: #br#When set by software, this bit starts a session. #br# #br#When operating as a Device: #br#The USB controller has started a session. When set by software, the Session Request Protocol is initiated. #br# #br#Clearing this bit when the USB controller is not suspended results in undefined behavior."/>
        </bitfield>
        <bitfield id="HOSTREQ" description="When set, the USB controller will initiate the Host Negotiation when Suspend mode is entered.  It is cleared when Host Negotiation is completed." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="EFFECT" value="0x1" description="Initiates the Host Negotiation when SUSPENDmode is entered."/>
        </bitfield>
        <bitfield id="HOST" description="Host Mode.
This Read-only bit is set when the USB controller is acting as a Host.
Note: Only valid while a session is in progress." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="DEVICE" value="0x0" description="The USB controller is acting as a Device."/>
            <bitenum id="HOST" value="0x1" description="The USB controller is acting as a Host."/>
        </bitfield>
        <bitfield id="VUSB" description="VUSB / USB-PHY is powered." begin="4" end="3" width="2" rwaccess="R">
            <bitenum id="NOT_POWERED" value="0x0" description="VUSB / USB-PHY supply is detected as under 1.35V."/>
            <bitenum id="POWERED" value="0x3" description="VUSB / USB-PHY supply is detected as above 1.35V."/>
        </bitfield>
        <bitfield id="LSDEV" description="Low Speed Device Detected.
This Read-only bit is set when a low-speed device has been detected being connected to the port.
Note: Only valid in Host mode." begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="NO_DETCT" value="0x0" description="A low-speed Device has not been detected on the port."/>
            <bitenum id="DETCT" value="0x1" description="A low-speed Device has been detected on the port."/>
        </bitfield>
        <bitfield id="FSDEV" description="Full Speed Device Detected.
This Read-only bit is set when a full-speed device has been detected being connected to the port. 
Note: Only valid in Host mode." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="NO_DETCT" value="0x0" description="A full-speed Device has not been detected on the port."/>
            <bitenum id="DETCT" value="0x1" description="A full-speed Device has been detected on the port."/>
        </bitfield>
        <bitfield id="DEV" description="Device Mode.
This Read-only bit indicates whether the USB controller is operating as the host mode or device mode. 
Note: Only valid while a session is in progress." begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="HOST" value="0x0" description="The USB controller is operating in host mode."/>
            <bitenum id="DEVICE" value="0x1" description="The USB controller is operating in device mode."/>
        </bitfield>
    </register>
    <register id="USBFS0_MISC" width="8" offset="0x2061" description="USB Miscellaneous Register">
        <bitfield id="RX_EDMA" description="Receive early DMA mode." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LATE" value="0x0" description="Late mode: DMA_REQ signal for all OUT Endpoints will be de-asserted when MAXP bytes have been read to an endpoint."/>
            <bitenum id="EARLY" value="0x1" description="Early Mode: DMA_REQ signal for all OUT Endpoints will be de-asserted when MAXP-8 bytes have been read to an endpoint."/>
        </bitfield>
        <bitfield id="TX_EDMA" description="Transmit early DMA mode." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LATE" value="0x0" description="Late mode: DMA_REQ signal for all IN Endpoints will be de-asserted when MAXP bytes have been written to an endpoint. This is late mode."/>
            <bitenum id="EARLY" value="0x1" description="Early mode: DMA_REQ signal for all IN Endpoints will be de-asserted when MAXP-8 bytes have been written to an endpoint. This is early mode."/>
        </bitfield>
    </register>
    <register id="USBFS0_IDXTXFIFOSZ" width="8" offset="0x2062" description="Indexed USB Transmit Dynamic FIFO Sizing">
        <bitfield id="SIZE" description="Max Packet Size" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="BYTES_8" value="0x0" description="FIFO size 8-byte"/>
            <bitenum id="BYTES_16" value="0x1" description="FIFO size 16-byte"/>
            <bitenum id="BYTES_32" value="0x2" description="FIFO size 32-byte"/>
            <bitenum id="BYTES_64" value="0x3" description="FIFO size 64-byte"/>
            <bitenum id="BYTES_128" value="0x4" description="FIFO size 128-byte"/>
            <bitenum id="BYTES_256" value="0x5" description="FIFO size 256-byte"/>
            <bitenum id="BYTES_512" value="0x6" description="FIFO size 512-byte"/>
            <bitenum id="BYTES_1024" value="0x7" description="FIFO size 1024-byte"/>
            <bitenum id="BYTES_2048" value="0x8" description="FIFO size 2048-byte"/>
        </bitfield>
        <bitfield id="DPB" description="Double Packet Buffer Support" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="SIGLE" value="0x0" description="Single packet buffering is supported."/>
            <bitenum id="DOUBLE" value="0x1" description="Double packet buffering is enabled."/>
        </bitfield>
    </register>
