ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/USBFS0_1.0.xml
    <register id="USBFS0_IDXRXFIFOADD" width="16" offset="0x2066" description="Indexed USB Receive FIFO Start Address">
        <bitfield id="ADDR" description="Endpoint Data" begin="13" end="0" width="14" rwaccess="R/W">
            <bitenum id="ADDR_0" value="0x0" description="0.0"/>
            <bitenum id="ADDR_8" value="0x1" description="8.0"/>
            <bitenum id="ADDR_16" value="0x2" description="16.0"/>
            <bitenum id="ADDR_24" value="0x3" description="24.0"/>
            <bitenum id="ADDR_32" value="0x4" description="32.0"/>
            <bitenum id="ADDR_40" value="0x5" description="40.0"/>
            <bitenum id="ADDR_48" value="0x6" description="48.0"/>
            <bitenum id="ADDR_56" value="0x7" description="56.0"/>
            <bitenum id="ADDR_64" value="0x8" description="64.0"/>
            <bitenum id="ADDR_72" value="0x9" description="72.0"/>
            <bitenum id="ADDR_80" value="0xA" description="80.0"/>
            <bitenum id="ADDR_88" value="0xB" description="88.0"/>
            <bitenum id="ADDR_96" value="0xC" description="96.0"/>
            <bitenum id="ADDR_104" value="0xD" description="104.0"/>
            <bitenum id="ADDR_112" value="0xE" description="112.0"/>
            <bitenum id="ADDR_120" value="0xF" description="120.0"/>
            <bitenum id="ADDR_128" value="0x10" description="128.0"/>
            <bitenum id="ADDR_136" value="0x11" description="136.0"/>
            <bitenum id="ADDR_144" value="0x12" description="144.0"/>
            <bitenum id="ADDR_152" value="0x13" description="152.0"/>
            <bitenum id="ADDR_160" value="0x14" description="160.0"/>
            <bitenum id="ADDR_168" value="0x15" description="168.0"/>
            <bitenum id="ADDR_176" value="0x16" description="176.0"/>
            <bitenum id="ADDR_184" value="0x17" description="184.0"/>
            <bitenum id="ADDR_192" value="0x18" description="192.0"/>
            <bitenum id="ADDR_200" value="0x19" description="200.0"/>
            <bitenum id="ADDR_208" value="0x1A" description="208.0"/>
            <bitenum id="ADDR_216" value="0x1B" description="216.0"/>
            <bitenum id="ADDR_224" value="0x1C" description="224.0"/>
            <bitenum id="ADDR_232" value="0x1D" description="232.0"/>
            <bitenum id="ADDR_240" value="0x1E" description="240.0"/>
            <bitenum id="ADDR_248" value="0x1F" description="248.0"/>
            <bitenum id="ADDR_256" value="0x20" description="256.0"/>
            <bitenum id="ADDR_264" value="0x21" description="264.0"/>
            <bitenum id="ADDR_272" value="0x22" description="272.0"/>
            <bitenum id="ADDR_280" value="0x23" description="280.0"/>
            <bitenum id="ADDR_288" value="0x24" description="288.0"/>
            <bitenum id="ADDR_296" value="0x25" description="296.0"/>
            <bitenum id="ADDR_304" value="0x26" description="304.0"/>
            <bitenum id="ADDR_312" value="0x27" description="312.0"/>
            <bitenum id="ADDR_320" value="0x28" description="320.0"/>
            <bitenum id="ADDR_328" value="0x29" description="328.0"/>
            <bitenum id="ADDR_336" value="0x2A" description="336.0"/>
            <bitenum id="ADDR_344" value="0x2B" description="344.0"/>
            <bitenum id="ADDR_352" value="0x2C" description="352.0"/>
            <bitenum id="ADDR_360" value="0x2D" description="360.0"/>
            <bitenum id="ADDR_368" value="0x2E" description="368.0"/>
            <bitenum id="ADDR_376" value="0x2F" description="376.0"/>
            <bitenum id="ADDR_384" value="0x30" description="384.0"/>
            <bitenum id="ADDR_392" value="0x31" description="392.0"/>
            <bitenum id="ADDR_400" value="0x32" description="400.0"/>
            <bitenum id="ADDR_408" value="0x33" description="408.0"/>
            <bitenum id="ADDR_416" value="0x34" description="416.0"/>
            <bitenum id="ADDR_424" value="0x35" description="424.0"/>
            <bitenum id="ADDR_432" value="0x36" description="432.0"/>
            <bitenum id="ADDR_440" value="0x37" description="440.0"/>
            <bitenum id="ADDR_448" value="0x38" description="448.0"/>
            <bitenum id="ADDR_456" value="0x39" description="456.0"/>
            <bitenum id="ADDR_464" value="0x3A" description="464.0"/>
            <bitenum id="ADDR_472" value="0x3B" description="472.0"/>
            <bitenum id="ADDR_480" value="0x3C" description="480.0"/>
            <bitenum id="ADDR_488" value="0x3D" description="488.0"/>
            <bitenum id="ADDR_496" value="0x3E" description="496.0"/>
            <bitenum id="ADDR_504" value="0x3F" description="504.0"/>
            <bitenum id="ADDR_512" value="0x40" description="512.0"/>
            <bitenum id="ADDR_520" value="0x41" description="520.0"/>
            <bitenum id="ADDR_528" value="0x42" description="528.0"/>
            <bitenum id="ADDR_536" value="0x43" description="536.0"/>
            <bitenum id="ADDR_544" value="0x44" description="544.0"/>
            <bitenum id="ADDR_552" value="0x45" description="552.0"/>
            <bitenum id="ADDR_560" value="0x46" description="560.0"/>
            <bitenum id="ADDR_568" value="0x47" description="568.0"/>
            <bitenum id="ADDR_576" value="0x48" description="576.0"/>
            <bitenum id="ADDR_584" value="0x49" description="584.0"/>
            <bitenum id="ADDR_592" value="0x4A" description="592.0"/>
            <bitenum id="ADDR_600" value="0x4B" description="600.0"/>
            <bitenum id="ADDR_608" value="0x4C" description="608.0"/>
            <bitenum id="ADDR_616" value="0x4D" description="616.0"/>
            <bitenum id="ADDR_624" value="0x4E" description="624.0"/>
            <bitenum id="ADDR_632" value="0x4F" description="632.0"/>
            <bitenum id="ADDR_640" value="0x50" description="640.0"/>
            <bitenum id="ADDR_648" value="0x51" description="648.0"/>
            <bitenum id="ADDR_656" value="0x52" description="656.0"/>
            <bitenum id="ADDR_664" value="0x53" description="664.0"/>
            <bitenum id="ADDR_672" value="0x54" description="672.0"/>
            <bitenum id="ADDR_680" value="0x55" description="680.0"/>
            <bitenum id="ADDR_688" value="0x56" description="688.0"/>
            <bitenum id="ADDR_696" value="0x57" description="696.0"/>
            <bitenum id="ADDR_704" value="0x58" description="704.0"/>
            <bitenum id="ADDR_712" value="0x59" description="712.0"/>
            <bitenum id="ADDR_720" value="0x5A" description="720.0"/>
            <bitenum id="ADDR_728" value="0x5B" description="728.0"/>
            <bitenum id="ADDR_736" value="0x5C" description="736.0"/>
            <bitenum id="ADDR_744" value="0x5D" description="744.0"/>
            <bitenum id="ADDR_752" value="0x5E" description="752.0"/>
            <bitenum id="ADDR_760" value="0x5F" description="760.0"/>
            <bitenum id="ADDR_768" value="0x60" description="768.0"/>
            <bitenum id="ADDR_776" value="0x61" description="776.0"/>
            <bitenum id="ADDR_784" value="0x62" description="784.0"/>
            <bitenum id="ADDR_792" value="0x63" description="792.0"/>
            <bitenum id="ADDR_800" value="0x64" description="800.0"/>
            <bitenum id="ADDR_808" value="0x65" description="808.0"/>
            <bitenum id="ADDR_816" value="0x66" description="816.0"/>
            <bitenum id="ADDR_824" value="0x67" description="824.0"/>
            <bitenum id="ADDR_832" value="0x68" description="832.0"/>
            <bitenum id="ADDR_840" value="0x69" description="840.0"/>
            <bitenum id="ADDR_848" value="0x6A" description="848.0"/>
            <bitenum id="ADDR_856" value="0x6B" description="856.0"/>
            <bitenum id="ADDR_864" value="0x6C" description="864.0"/>
            <bitenum id="ADDR_872" value="0x6D" description="872.0"/>
            <bitenum id="ADDR_880" value="0x6E" description="880.0"/>
            <bitenum id="ADDR_888" value="0x6F" description="888.0"/>
            <bitenum id="ADDR_896" value="0x70" description="896.0"/>
            <bitenum id="ADDR_904" value="0x71" description="904.0"/>
            <bitenum id="ADDR_912" value="0x72" description="912.0"/>
            <bitenum id="ADDR_920" value="0x73" description="920.0"/>
            <bitenum id="ADDR_928" value="0x74" description="928.0"/>
            <bitenum id="ADDR_936" value="0x75" description="936.0"/>
            <bitenum id="ADDR_944" value="0x76" description="944.0"/>
            <bitenum id="ADDR_952" value="0x77" description="952.0"/>
            <bitenum id="ADDR_960" value="0x78" description="960.0"/>
            <bitenum id="ADDR_968" value="0x79" description="968.0"/>
            <bitenum id="ADDR_976" value="0x7A" description="976.0"/>
            <bitenum id="ADDR_984" value="0x7B" description="984.0"/>
            <bitenum id="ADDR_992" value="0x7C" description="992.0"/>
            <bitenum id="ADDR_1000" value="0x7D" description="1000.0"/>
            <bitenum id="ADDR_1008" value="0x7E" description="1008.0"/>
            <bitenum id="ADDR_1016" value="0x7F" description="1016.0"/>
            <bitenum id="ADDR_1024" value="0x80" description="1024.0"/>
            <bitenum id="ADDR_1032" value="0x81" description="1032.0"/>
            <bitenum id="ADDR_1040" value="0x82" description="1040.0"/>
            <bitenum id="ADDR_1048" value="0x83" description="1048.0"/>
            <bitenum id="ADDR_1056" value="0x84" description="1056.0"/>
            <bitenum id="ADDR_1064" value="0x85" description="1064.0"/>
            <bitenum id="ADDR_1072" value="0x86" description="1072.0"/>
            <bitenum id="ADDR_1080" value="0x87" description="1080.0"/>
            <bitenum id="ADDR_1088" value="0x88" description="1088.0"/>
            <bitenum id="ADDR_1096" value="0x89" description="1096.0"/>
            <bitenum id="ADDR_1104" value="0x8A" description="1104.0"/>
            <bitenum id="ADDR_1112" value="0x8B" description="1112.0"/>
            <bitenum id="ADDR_1120" value="0x8C" description="1120.0"/>
            <bitenum id="ADDR_1128" value="0x8D" description="1128.0"/>
            <bitenum id="ADDR_1136" value="0x8E" description="1136.0"/>
            <bitenum id="ADDR_1144" value="0x8F" description="1144.0"/>
            <bitenum id="ADDR_1152" value="0x90" description="1152.0"/>
            <bitenum id="ADDR_1160" value="0x91" description="1160.0"/>
            <bitenum id="ADDR_1168" value="0x92" description="1168.0"/>
            <bitenum id="ADDR_1176" value="0x93" description="1176.0"/>
            <bitenum id="ADDR_1184" value="0x94" description="1184.0"/>
            <bitenum id="ADDR_1192" value="0x95" description="1192.0"/>
            <bitenum id="ADDR_1200" value="0x96" description="1200.0"/>
            <bitenum id="ADDR_1208" value="0x97" description="1208.0"/>
            <bitenum id="ADDR_1216" value="0x98" description="1216.0"/>
            <bitenum id="ADDR_1224" value="0x99" description="1224.0"/>
            <bitenum id="ADDR_1232" value="0x9A" description="1232.0"/>
            <bitenum id="ADDR_1240" value="0x9B" description="1240.0"/>
            <bitenum id="ADDR_1248" value="0x9C" description="1248.0"/>
            <bitenum id="ADDR_1256" value="0x9D" description="1256.0"/>
            <bitenum id="ADDR_1264" value="0x9E" description="1264.0"/>
            <bitenum id="ADDR_1272" value="0x9F" description="1272.0"/>
            <bitenum id="ADDR_1280" value="0xA0" description="1280.0"/>
            <bitenum id="ADDR_1288" value="0xA1" description="1288.0"/>
            <bitenum id="ADDR_1296" value="0xA2" description="1296.0"/>
            <bitenum id="ADDR_1304" value="0xA3" description="1304.0"/>
            <bitenum id="ADDR_1312" value="0xA4" description="1312.0"/>
            <bitenum id="ADDR_1320" value="0xA5" description="1320.0"/>
            <bitenum id="ADDR_1328" value="0xA6" description="1328.0"/>
            <bitenum id="ADDR_1336" value="0xA7" description="1336.0"/>
            <bitenum id="ADDR_1344" value="0xA8" description="1344.0"/>
            <bitenum id="ADDR_1352" value="0xA9" description="1352.0"/>
            <bitenum id="ADDR_1360" value="0xAA" description="1360.0"/>
            <bitenum id="ADDR_1368" value="0xAB" description="1368.0"/>
            <bitenum id="ADDR_1376" value="0xAC" description="1376.0"/>
            <bitenum id="ADDR_1384" value="0xAD" description="1384.0"/>
            <bitenum id="ADDR_1392" value="0xAE" description="1392.0"/>
            <bitenum id="ADDR_1400" value="0xAF" description="1400.0"/>
            <bitenum id="ADDR_1408" value="0xB0" description="1408.0"/>
            <bitenum id="ADDR_1416" value="0xB1" description="1416.0"/>
            <bitenum id="ADDR_1424" value="0xB2" description="1424.0"/>
            <bitenum id="ADDR_1432" value="0xB3" description="1432.0"/>
            <bitenum id="ADDR_1440" value="0xB4" description="1440.0"/>
            <bitenum id="ADDR_1448" value="0xB5" description="1448.0"/>
            <bitenum id="ADDR_1456" value="0xB6" description="1456.0"/>
            <bitenum id="ADDR_1464" value="0xB7" description="1464.0"/>
            <bitenum id="ADDR_1472" value="0xB8" description="1472.0"/>
            <bitenum id="ADDR_1480" value="0xB9" description="1480.0"/>
            <bitenum id="ADDR_1488" value="0xBA" description="1488.0"/>
            <bitenum id="ADDR_1496" value="0xBB" description="1496.0"/>
            <bitenum id="ADDR_1504" value="0xBC" description="1504.0"/>
            <bitenum id="ADDR_1512" value="0xBD" description="1512.0"/>
            <bitenum id="ADDR_1520" value="0xBE" description="1520.0"/>
            <bitenum id="ADDR_1528" value="0xBF" description="1528.0"/>
            <bitenum id="ADDR_1536" value="0xC0" description="1536.0"/>
            <bitenum id="ADDR_1544" value="0xC1" description="1544.0"/>
            <bitenum id="ADDR_1552" value="0xC2" description="1552.0"/>
            <bitenum id="ADDR_1560" value="0xC3" description="1560.0"/>
            <bitenum id="ADDR_1568" value="0xC4" description="1568.0"/>
            <bitenum id="ADDR_1576" value="0xC5" description="1576.0"/>
            <bitenum id="ADDR_1584" value="0xC6" description="1584.0"/>
            <bitenum id="ADDR_1592" value="0xC7" description="1592.0"/>
            <bitenum id="ADDR_1600" value="0xC8" description="1600.0"/>
            <bitenum id="ADDR_1608" value="0xC9" description="1608.0"/>
            <bitenum id="ADDR_1616" value="0xCA" description="1616.0"/>
            <bitenum id="ADDR_1624" value="0xCB" description="1624.0"/>
            <bitenum id="ADDR_1632" value="0xCC" description="1632.0"/>
            <bitenum id="ADDR_1640" value="0xCD" description="1640.0"/>
            <bitenum id="ADDR_1648" value="0xCE" description="1648.0"/>
            <bitenum id="ADDR_1656" value="0xCF" description="1656.0"/>
            <bitenum id="ADDR_1664" value="0xD0" description="1664.0"/>
            <bitenum id="ADDR_1672" value="0xD1" description="1672.0"/>
            <bitenum id="ADDR_1680" value="0xD2" description="1680.0"/>
            <bitenum id="ADDR_1688" value="0xD3" description="1688.0"/>
            <bitenum id="ADDR_1696" value="0xD4" description="1696.0"/>
            <bitenum id="ADDR_1704" value="0xD5" description="1704.0"/>
            <bitenum id="ADDR_1712" value="0xD6" description="1712.0"/>
            <bitenum id="ADDR_1720" value="0xD7" description="1720.0"/>
            <bitenum id="ADDR_1728" value="0xD8" description="1728.0"/>
            <bitenum id="ADDR_1736" value="0xD9" description="1736.0"/>
            <bitenum id="ADDR_1744" value="0xDA" description="1744.0"/>
            <bitenum id="ADDR_1752" value="0xDB" description="1752.0"/>
            <bitenum id="ADDR_1760" value="0xDC" description="1760.0"/>
            <bitenum id="ADDR_1768" value="0xDD" description="1768.0"/>
            <bitenum id="ADDR_1776" value="0xDE" description="1776.0"/>
            <bitenum id="ADDR_1784" value="0xDF" description="1784.0"/>
            <bitenum id="ADDR_1792" value="0xE0" description="1792.0"/>
            <bitenum id="ADDR_1800" value="0xE1" description="1800.0"/>
            <bitenum id="ADDR_1808" value="0xE2" description="1808.0"/>
            <bitenum id="ADDR_1816" value="0xE3" description="1816.0"/>
            <bitenum id="ADDR_1824" value="0xE4" description="1824.0"/>
            <bitenum id="ADDR_1832" value="0xE5" description="1832.0"/>
            <bitenum id="ADDR_1840" value="0xE6" description="1840.0"/>
            <bitenum id="ADDR_1848" value="0xE7" description="1848.0"/>
            <bitenum id="ADDR_1856" value="0xE8" description="1856.0"/>
            <bitenum id="ADDR_1864" value="0xE9" description="1864.0"/>
            <bitenum id="ADDR_1872" value="0xEA" description="1872.0"/>
            <bitenum id="ADDR_1880" value="0xEB" description="1880.0"/>
            <bitenum id="ADDR_1888" value="0xEC" description="1888.0"/>
            <bitenum id="ADDR_1896" value="0xED" description="1896.0"/>
            <bitenum id="ADDR_1904" value="0xEE" description="1904.0"/>
            <bitenum id="ADDR_1912" value="0xEF" description="1912.0"/>
            <bitenum id="ADDR_1920" value="0xF0" description="1920.0"/>
            <bitenum id="ADDR_1928" value="0xF1" description="1928.0"/>
            <bitenum id="ADDR_1936" value="0xF2" description="1936.0"/>
            <bitenum id="ADDR_1944" value="0xF3" description="1944.0"/>
            <bitenum id="ADDR_1952" value="0xF4" description="1952.0"/>
            <bitenum id="ADDR_1960" value="0xF5" description="1960.0"/>
            <bitenum id="ADDR_1968" value="0xF6" description="1968.0"/>
            <bitenum id="ADDR_1976" value="0xF7" description="1976.0"/>
            <bitenum id="ADDR_1984" value="0xF8" description="1984.0"/>
            <bitenum id="ADDR_1992" value="0xF9" description="1992.0"/>
            <bitenum id="ADDR_2000" value="0xFA" description="2000.0"/>
            <bitenum id="ADDR_2008" value="0xFB" description="2008.0"/>
            <bitenum id="ADDR_2016" value="0xFC" description="2016.0"/>
            <bitenum id="ADDR_2024" value="0xFD" description="2024.0"/>
            <bitenum id="ADDR_2032" value="0xFE" description="2032.0"/>
            <bitenum id="ADDR_2040" value="0xFF" description="2040.0"/>
        </bitfield>
    </register>
    <register id="USBFS0_EPINFO" width="8" offset="0x2078" description="Endpoint Information">
        <bitfield id="TXENDPOINTS" description="The number of TX endpoints implemented in the design." begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="RXENDPOINTS" description="The number of Rx endpoints implemented in the design." begin="7" end="4" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="USBFS0_RAMINFO" width="8" offset="0x2079" description="USB FIFO Buffer RAM Information">
        <bitfield id="RAMBITS" description="The width of the RAM address bus." begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="RAM_1KB" value="0x8" description="USB FIFO RAM size is 1kB"/>
            <bitenum id="RAM_2KB" value="0x9" description="USB FIFO RAM size is 2kB"/>
            <bitenum id="RAM_4KB" value="0xA" description="USB FIFO RAM size is 4kB"/>
        </bitfield>
    </register>
    <register id="USBFS0_CONTIM" width="8" offset="0x207A" description="USB Connect Timing">
        <bitfield id="WTID" description="The wait ID field configures the delay required from the enable of the ID detection to when the ID value is valid, in units of 4.369 ms.
Note: The default corresponds to 52.43 ms." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="WTCON" description="The connect wait field configures the wait required to allow for the user's connect/disconnect filter, in units of 533.3 ns.
Note: The default corresponds to 2.667 us." begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="USBFS0_FSEOF" width="8" offset="0x207D" description="USB Full-Speed Last Transaction to End of Frame Timing">
    </register>
    <register id="USBFS0_LSEOF" width="8" offset="0x207E" description="USB Low-Speed Last Transaction to End of Frame Timing">
    </register>
    <group id="USBFS0_TADDR" name="USBFS0_TADDR" instances="16" offset="0x2080" instaddr="0x8" description="USB Target Address Register for Endpoint [y]">
        <register id="USBFS0_TXFUNCADDR" width="8" offset="0x0" description="USB Transmit Functional Address Endpoint [n]">
            <bitfield id="ADDR" description="Device Address specifies the USB bus address for the target Device." begin="6" end="0" width="7" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="USBFS0_TXHUBADDR" width="8" offset="0x2" description="USB Transmit Hub Address Endpoint [n]">
            <bitfield id="ADDR" description="Device Address specifies the USB bus address for the target Device." begin="6" end="0" width="7" rwaccess="R/W">
            </bitfield>
            <bitfield id="MULTTRAN" description="Record whether the hub has multiple transaction translators." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLEAR" value="0x0" description="Clear to indicate that the hub has a single transaction translator."/>
                <bitenum id="SET" value="0x1" description="Set to indicate that the hub has multiple transaction translators."/>
            </bitfield>
        </register>
        <register id="USBFS0_TXHUBPORT" width="8" offset="0x3" description="USB Transmit Hub Port Endpoint [n]">
            <bitfield id="ADDR" description="Hub Port specifies the USB hub port number." begin="6" end="0" width="7" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="USBFS0_RXFUNCADDR" width="8" offset="0x4" description="USB Receive Functional Address Endpoint [n]">
            <bitfield id="ADDR" description="Device Address specifies the USB bus address for the target Device." begin="6" end="0" width="7" rwaccess="R/W">
            </bitfield>
        </register>
