ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/USBFS0_1.0.xml
        <register id="USBFS0_RXHUBADDR" width="8" offset="0x6" description="USB Receive Hub Address Endpoint [n]">
            <bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="R/W">
            </bitfield>
            <bitfield id="MULTTRAN" description="Record whether the hub has multiple transaction translators." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLEAR" value="0x0" description="Clear to indicate that the hub has a single transaction translator."/>
                <bitenum id="SET" value="0x1" description="Set to indicate that the hub has multiple transaction translators."/>
            </bitfield>
        </register>
        <register id="USBFS0_RXHUBPORT" width="8" offset="0x7" description="USB Receive Hub Port Endpoint [n]">
            <bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="R/W">
            </bitfield>
        </register>
        </group>
    <register id="USBFS0_CSR0L" width="8" offset="0x2102" description="USB Control and Status Endpoint 0 Low">
        <bitfield id="RXRDY" description="Receive Packet Ready.
Device mode: This bit is set when a data packet has been received. An interrupt is generated when this bit is set. The CPU clears this bit by setting the RXRDYC_STATUS bit.
Host mode: Software must clear this bit after he packet has been read from the FIFO to acknowledge that the data has been read from the FIFO." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_PACKET" value="0x0" description="No receive packet has been received."/>
            <bitenum id="RECV" value="0x1" description="Indicates that a data packet has been received in the RX FIFO. The EP0 bit in the USBTXIS register is also set in this situation."/>
        </bitfield>
        <bitfield id="TXRDY" description="Transmit Packet Ready.
Device &amp; Host mode: The CPU sets this bit after loading a data packet into the FIFO. It is cleared automatically when a data packet has been transmitted. An interrupt is also generated at this point (if enabled).
Host mode: If both the TXRDY and DATAEND_SETUP bits are set, a setup packet is sent. If just TXRDY is set, an OUT packet is sent." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="WAIT" value="0x0" description="No transmit packet is ready."/>
            <bitenum id="READY" value="0x1" description="Software sets this bit after loading a data packet into the TX FIFO. The EP0 bit in the USBTXIS register is also set in this situation."/>
        </bitfield>
        <bitfield id="STALLED" description="Sent Stall / Receive Stall 
Device mode: This bit is set when a STALL handshake is transmitted. The CPU should clear this bit.
Host mode: This bit is set when a STALL handshake is received. The CPU should clear this bit." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_HANDSHAKE" value="0x0" description="No handshake has been received."/>
            <bitenum id="HANDSHAKE" value="0x1" description="A STALL handshake has been received or transmitted"/>
        </bitfield>
        <bitfield id="DATAEND_SETUP" description="Data end / Setup Packet.
Device mode: Data end bit. The CPU sets this bit: 
1. When setting TXRDY for the last data packet.
2. When clearing RXRDY after unloading the last data packet.
3. When setting TXRDY for a zero length data packet.
Host mode: Setup packet. The CPU sets this bit, at the same time as the TXRDY bit is set, to send a SETUP token instead of an OUT token for the transaction.
Note: Setting this bit always clears the DT bit in the USBCSRH0 register." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="EFFECT" value="0x0" description="No effect"/>
            <bitenum id="EFFECT" value="0x1" description="Indicates date end or sends setup token."/>
        </bitfield>
        <bitfield id="SETEND_ERROR" description="Setup end / Error.
Device mode: Setup end. This bit will be set when a control transaction ends before the DATAEND_SETUP bit has been set. An interrupt will be generated and the FIFO flushed at this time. The bit is cleared by the CPU writing a 1 to the SETENDC_NAKTO bit.
Host mode: Error indication. This bit will be set when three attempts have been made to perform a transaction with no response from the peripheral. The CPU should clear this bit. An interrupt is generated when this bit is set." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Clear Error. Note: Only effective in host mode."/>
            <bitenum id="EFFECT" value="0x1" description="Setup end / Error indication."/>
        </bitfield>
        <bitfield id="STALL_RQPKT" description="Send Stall / Request Packet.
Device mode: The CPU writes a 1 to this bit to terminate the current transaction. The STALL handshake will be transmitted and then this bit will be cleared automatically.
Host mode: The CPU sets this bit to request an IN transaction. It is cleared when RXRDY bit is set." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="EFFECT" value="0x1" description="Send stall request or request packet is in effect."/>
        </bitfield>
        <bitfield id="RXRDYC_STATUS" description="Receive ready clear / Status packet
Device mode: Receive ready clear. The CPU writes a 1 to this bit to clear the RXRDY bit. It is cleared automatically
Host mode: Status Packet. The CPU sets this bit at the same time as the TXRDY or STALL_RQPKT bit is set, to perform a status stage transaction. Setting this bit ensures that the DT bit is set in the USBCSRH0 register, so that a DATA1 packet is used for the Status Stage transaction.

Setting this bit ensures that the DT bit is set in the USBCSRH0 register so that a DATA1 packet is used for the STATUS stage transaction." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No transaction"/>
            <bitenum id="EFFECT" value="0x1" description="Clear RXRDY or sent status packet."/>
        </bitfield>
        <bitfield id="SETENDC_NAKTO" description="Setup End Clear / NAK Timeout
Device mode: The CPU writes a 1 to this bit to clear the SETEND_ERROR bit. It is cleared automatically.
Host mode: This bit will be set when Endpoint 0 is halted following the receipt of NAK responses for longer than the time set by the USBNAKLMT register. The CPU should clear this bit to allow the endpoint to continue." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="EFFECT" value="0x1" description="Clear SETEND_ERROR or SETENDC_KAKTO"/>
        </bitfield>
    </register>
    <register id="USBFS0_CSR0H" width="8" offset="0x2103" description="USB Control and Status Endpoint 0 High">
        <bitfield id="FLUSH" description="Flush FIFO.
The CPU writes a 1 to this bit to flush the next packet to be transmitted/read from the Endpoint 0 FIFO. The FIFO pointer is reset and the TXRDY/RXRDY bit in the USBCSRL0 register is cleared.
Note: FLUSH should only be used when TXRDY/RXRDY is set. At other times, it may cause data to be corrupted." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="EFFECT" value="0x1" description="Flush the FIFO"/>
        </bitfield>
        <bitfield id="DT" description="Data Toggle.
When read, this bit indicates the current state of the endpoint 0 data toggle. If DTWE is set, this bit may be written with the required setting of the data toggle. If DTWE is Low, this bit cannot be written. Care should be taken when writing to this bit as it should only be changed to RESET USB endpoint 0.
Note: This bit is only effective in host mode." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="Data toggle is low"/>
            <bitenum id="HIGH" value="0x1" description="Data toggle is high"/>
        </bitfield>
        <bitfield id="DTWE" description="Data Toggle Write Enable.
This bit is automatically cleared once the new value is written.
Note: This bit is only effective in host mode." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The DT bit cannot be written."/>
            <bitenum id="ENABLE" value="0x1" description="Enables the current state of the endpoint 0 data toggle to be written (see DT bit)."/>
        </bitfield>
        <bitfield id="DISPING" description="Diable PING tokens in data and status phases of a high-speed Control transfer." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Ping is allowed."/>
            <bitenum id="SET" value="0x1" description="Ping is not allowed."/>
        </bitfield>
    </register>
    <register id="USBFS0_COUNT0" width="8" offset="0x2108" description="USB Receive Byte Count Endpoint 0">
        <bitfield id="COUNT" description="FIFO Count.
COUNT is a read-only value that indicates the number of received data bytes in the endpoint 0 FIFO.
The value returned changes as the contents of the FIFO change and is only valid while RXRDY (USBCSRL.RXRDY) is set." begin="6" end="0" width="7" rwaccess="R">
        </bitfield>
    </register>
