ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/USBFS0_1.0.xml
    <register id="USBFS0_TYPE0" width="8" offset="0x210A" description="USB Type Endpoint 0">
        <bitfield id="SPEED" description="Operating Speed specifies the operating speed of the target Device. If selected, the target is assumed  #br#to have the same connection speed as the USB controller." begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="UNUSED" value="0x0" description="Unused (Note: If selected, the target will be assumed to be using the same connection speed as the USB controller.)"/>
            <bitenum id="FULL" value="0x2" description="Full-speed"/>
            <bitenum id="LOW" value="0x3" description="Low-speed"/>
        </bitfield>
    </register>
    <register id="USBFS0_NAKLMT0" width="8" offset="0x210B" description="USB NAK Limit Endpoint 0">
        <bitfield id="NAKLMT" description="EP0 NAK Limit specifies the number of frames after receiving a stream of NAK responses." begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="USBFS0_CONFIG" width="8" offset="0x210F" description="USB Config Data">
        <bitfield id="UTMIDATWDTH" description="Indicates selected UTMI+ data width. Always 0 indicating 8 bits." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOFTCON" description="Always 1 . Indicates Soft Connect/Disconnect is enabled." begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="DYNFIFO" description="When set to 1 indicates Dynamic FIFO Sizing option selected." begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="HBTXE" description="When set to 1 indicates High-bandwidth TX ISO Endpoint Support selected." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="HBRXE" description="When set to 1 indicates High-bandwidth Rx ISO Endpoint Support selected." begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="BIGENDIAN" description="Always '0'. Indicates Little Endian ordering." begin="5" end="5" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="MPTXE" description="When set to 1, automatic splitting of bulk packets is selected." begin="6" end="6" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="MPRXE" description="When set to 1, automatic amalgamation of bulk packets is selected." begin="7" end="7" width="1" rwaccess="R">
        </bitfield>
    </register>
    <group id="USBFS0_CSR" name="USBFS0_CSR" instances="15" offset="0x2110" instaddr="0x10" description="USB Control and Status Register for Endpoint [y]">
        <register id="USBFS0_TXMAXP" width="16" offset="0x0" description="USB Maximum Transmit Data Endpoint [n]">
            <bitfield id="MAXLOAD" description="Maximum Payload specifies the maximum payload in bytes per transaction." begin="10" end="0" width="11" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="USBFS0_TXCSRL" width="8" offset="0x2" description="USB Transmit Control and Status Endpoint [n] Low">
            <bitfield id="TXRDY" description="Transmit Packet Ready.
The CPU sets this bit after loading a data packet into the FIFO. 
This bit is cleared automatically when a data packet has been transmitted. The EPn bit in the USBTXIS register is also set at this point. TXRDY is also automatically cleared prior to loading a second packet into a double-buffered FIFO.
Note: Host and device mode" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="WAIT" value="0x0" description="No transmit packet is ready."/>
                <bitenum id="READY" value="0x1" description="Software sets this bit after loading a data packet into the TX FIFO."/>
            </bitfield>
            <bitfield id="FIFONE" description="FIFO Not Empty.
The USB controller sets this bit when there is at least 1 packet in the TX FIFO.
Note: Host and device mode." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="EMPTY" value="0x0" description="The FIFO is empty"/>
                <bitenum id="NOT_EMPTY" value="0x1" description="At least one packet is in the transmit FIFO."/>
            </bitfield>
            <bitfield id="UNDRNERROR" description="Underrun / Error condition.
Device mode: The USB controller sets this bit if an IN token is received when TXRDY is not set. The CPU should clear this bit.
Host mode: The USB controller sets this bit when 3 attempts have been made to send a packet and no handshake packet has been received. When the bit is set, an interrupt is generated, TXRDY is cleared and the FIFO is completely flushed. The CPU should clear this bit. Valid only when the endpoint is operating in Bulk or Interrupt mode." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLEAR" value="0x0" description="No underrun or error condition"/>
                <bitenum id="SET" value="0x1" description="Underrun or error condition exist."/>
            </bitfield>
            <bitfield id="FLUSH" description="Flush FIFO.
The CPU writes a 1 to this bit to flush the latest packet from the endpoint TX FIFO. The FIFO pointer is reset, the TXRDY bit is cleared and an interrupt is generated. May be set simultaneously with TXRDY to abort the packet that is currently being loaded into the FIFO. 
Note: FLUSH should only be used when TXRDY is set. At other times, it may cause data to be corrupted. Also note that, if the FIFO is double-buffered, FLUSH may need to be set twice to completely clear the FIFO.
Note: Host and device mode." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="EFFECT" value="0x1" description="Flushes the latest packet from the endpoint transmit FIFO."/>
            </bitfield>
            <bitfield id="STALLSETUP" description="Send stall / Setup packet request.
Device mode: The CPU writes a 1 to this bit to issue a STALL handshake to an IN token. The CPU clears this bit to terminate the stall condition. Note: This bit has no effect where the endpoint is being used for Isochronous transfers.
Host mode: The CPU sets this bit, at the same time as the TXRDY bit is set, to send a SETUP token instead of an OUT token for the transaction. Note: Setting this bit also clears the USBTXCSRH.DT register." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLEAR" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Send stall or setup packet request."/>
            </bitfield>
            <bitfield id="STALLED" description="Sent stall / RX stalled.
Device mode: This bit is set when a STALL handshake is transmitted. The FIFO is flushed and the TXRDY bit is cleared. The CPU should clear this bit.
Host mode: This bit is set when a STALL handshake is received. When this bit is set, any DMA request that is in progress is stopped, the FIFO is completely flushed and the TXRDY bit is cleared. The CPU should clear this bit." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLEAR" value="0x0" description="Clear stall indication."/>
                <bitenum id="SET" value="0x1" description="Indicates that a STALL handshake has been sent or received."/>
            </bitfield>
            <bitfield id="CLRDT" description="Clear DataToggle.
The CPU writes a 1 to this bit to reset the endpoint data toggle to 0.
Note: Host and device mode." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="EFFECT" value="0x1" description="Writing a 1 to this bit clears the DT bit in the USBTXCSRH[n] register."/>
            </bitfield>
            <bitfield id="INCOMPNAKTO" description="Incomplete TX / NAK Timeout.
Device mode: When the endpoint is being used for high-bandwidth Isochronous, this bit is set to indicate where a large packet has been split into 2 or 3 packets for transmission but insufficient IN tokens have been received to send all the parts. Note: In anything other than isochronous transfers, this bit
will always return 0.
Host mode - bulk endpoints only: This bit will be set when the TX endpoint is halted following the receipt of NAK responses for longer than the time set as theTXPOLLNAKLMT by the TXINTERVAL register. The CPU should clear this bit to allow the endpoint to continue.
Host mode - high-bandwidth Interrupt endpoints only: This bit will be set if no response is received from the device to which the packet is being sent." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLEAR" value="0x0" description="No condition present / clear condition."/>
                <bitenum id="SET" value="0x1" description="Condition present."/>
            </bitfield>
        </register>
        <register id="USBFS0_TXCSRH" width="8" offset="0x3" description="USB Transmit Control and Status Endpoint [n] High">
            <bitfield id="DT" description="Data Toggle.
When read, this bit indicates the current state of the transmit endpoint data toggle.
If DTWE is High, this bit can be written with the required setting of the data toggle. If DTWE is Low, any value written to this bit is ignored. Care should be taken when writing to this bit as it should only be changed to RESET the transmit endpoint.
Note: Host mode only" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="LOW" value="0x0" description="Data toggle is low"/>
                <bitenum id="HIGH" value="0x1" description="Data toggle is high"/>
            </bitfield>
            <bitfield id="DTWE" description="Data Toggle Write Enable. 
The CPU writes a 1 to this bit to enable the current state of the TX Endpoint data toggle to be
written. This bit is automatically cleared once the new value is written.
Note: Host mode only." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="The DT bit cannot be written."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the current state of the transmit endpoint data to be written (see DT bit)."/>
            </bitfield>
            <bitfield id="DMAMOD" description="DMA Request Mode.
The CPU sets this bit to select DMA Request Mode 1 and clears it to select DMA Request Mode 0.
Note: This bit must not be cleared either before or in the same cycle as the DMAEN bit is cleared.
Note: Device and host mode." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="MODE0" value="0x0" description="An interrupt is generated after every DMA packet transfer."/>
                <bitenum id="MODE1" value="0x1" description="An interrupt is generated only after the entire DMA transfer is complete."/>
            </bitfield>
            <bitfield id="FDT" description="Force Data Toggle.
The CPU sets this bit to force the endpoint DT bit to switch and the data packet to be cleared from the FIFO, regardless of whether an ACK was received. This can be used by Interrupt TX endpoints that are used to communicate rate feedback for Isochronous endpoints.
Note: This bit should only be set when the TXRDY bit is set. At other times, it may cause data to be corrupted.
Note: Device and host mode." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="EFFECT" value="0x1" description="Forces data toggle"/>
            </bitfield>
            <bitfield id="DMAEN" description="DMA Request Enable
The CPU sets this bit to enable the DMA request for the TX endpoint.
Note: Four TX and four RX endpoints can be connected to the DMA module. If this bit is set for a particular endpoint, the TRIGATX, TRIGBTX, TRIGCTX, or TRIGDTX field in the USB DMA Select (USBDMASEL) register must be programmed correspondingly.
Note: Device and host mode." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disables the DMA request for the transmit endpoint."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the DMA request for the transmit endpoint."/>
            </bitfield>
            <bitfield id="MODE" description="Mode
The CPU sets this bit to enable the endpoint direction as TX, and clears the bit to enable it as Rx. 
Note: This bit only has an effect when the same endpoint FIFO is used for both transmit and receive transactions.
Note: Host and device mode." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="RX" value="0x0" description="Enables the endpoint direction as RX."/>
                <bitenum id="TX" value="0x1" description="Enables the endpoint direction as TX."/>
            </bitfield>
            <bitfield id="ISO" description="Isochronous Transfers.
The CPU sets this bit to enable the TX endpoint for Isochronous transfers, and clears it to enable the TX endpoint for Bulk or Interrupt transfers. 
Note: This bit only has any effect in device mode. In host mode, it always returns zero." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="BULK_INT_TRANSFER" value="0x0" description="Enables the transmit endpoint for bulk or interrupt transfers."/>
                <bitenum id="ISO_TRANSFER" value="0x1" description="Enables the transmit endpoint for isochronous transfers."/>
            </bitfield>
            <bitfield id="AUTOSET" description="Auto Set.
If the CPU sets this bit, the TXRDY bit will be be automatically set when data of the maximum packet size (value in USBTXMAXP[n]) is loaded into the transmit FIFO. If a packet of less than the maximum packet size is loaded, then the TXRDY bit must be set manually.
Note: Should not be set for either high-bandwidth Isochronous endpoints or high-bandwidth Interrupt endpoints.
Note: Device and host mode." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="MANUAL" value="0x0" description="The TXRDY bit must be set manually."/>
                <bitenum id="AUTO" value="0x1" description="The TXRDY bit is automatically set when maximum packet size is loaded into the TX FIFO."/>
            </bitfield>
        </register>
        <register id="USBFS0_RXMAXP" width="16" offset="0x4" description="USB Maximum Receive Data Endpoint [n]">
            <bitfield id="MAXLOAD" description="Maximum Payload specifies the maximum payload in bytes per transaction." begin="10" end="0" width="11" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="USBFS0_RXCSRL" width="8" offset="0x6" description="USB Receive Control and Status Endpoint [n] Low">
            <bitfield id="RXRDY" description="Receive Packet Ready.
This bit is set when a data packet has been received. The CPU should clear this bit when the packet has been unloaded from the Rx FIFO. An interrupt is generated when the bit is set.
If the AUTOCLR bit in the USBRXCSRH[n] register is set, then the this bit is automatically cleared when a packet of USBRXMAXP[n] bytes has been unloaded from the receive FIFO. If the AUTOCLR bit is clear, or if packets of less than the maximum packet size are unloaded, then software must clear this bit manually when the packet has been unloaded from the receive FIFO.
Note: Device and host mode." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="WAIT" value="0x0" description="No data packet has been received."/>
                <bitenum id="READY" value="0x1" description="Indicates that a data packet has been received. The EP[j] bit in the USBTXIS register is also set in this situation"/>
            </bitfield>
            <bitfield id="FULL" description="FIFO Full.
This bit is set when no more packets can be loaded into the RX FIFO.
Note: Device and host mode." begin="1" end="1" width="1" rwaccess="R">
                <bitenum id="NO" value="0x0" description="The receive FIFO is not full."/>
                <bitenum id="YES" value="0x1" description="The receive FIFO is full. No more packets can be loaded into the receive FIFO."/>
            </bitfield>
            <bitfield id="OVERERROR" description="Over run / Error.
Device mode: Over run - This bit is set if an OUT packet cannot be loaded into the receive FIFO. The CPU should clear this bit. - Note: This bit is only valid when the endpoint is operating in ISO mode. In Bulk mode, it always returns zero.
Host mode: The USB sets this bit when 3 attempts have been made to receive a packet and no data packet has been received. The CPU should clear this bit. An interrupt is generated when the bit is set. - Note: This bit is only valid when the RX endpoint is operating in Bulk or Interrupt mode. In ISO mode, it always returns zero." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLEAR" value="0x0" description="No over run or error condition."/>
                <bitenum id="SET" value="0x1" description="Under run or error condition exist."/>
            </bitfield>
            <bitfield id="DATAERRNAKTO" description="Data Error / NAK Timeout
Device mode: Data Error - This bit is set when RXRDY is set, if the data packet has a CRC or bit-stuff error. It is cleared when RXRDY is cleared. - Note: This bit is only valid when the endpoint is operating in ISO mode. In Bulk mode, it always returns zero.
Host mode: NAK Timeout - When operating in ISO mode, this bit is set when RXRDY is set, if the data packet has a CRC or bit-stuff error and cleared when RXRDY is cleared. In Bulk mode, this bit will be set when the Rx endpoint is halted following the receipt of NAK responses for longer than the time set as the NAK Limit by the USBRXINTERVAL register. The CPU should clear this bit to allow the endpoint to continue." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLEAR" value="0x0" description="Normal operation"/>
                <bitenum id="SET" value="0x1" description="Data error or NAK Timeout condition exist."/>
            </bitfield>
            <bitfield id="FLUSH" description="Flush FIFO.
The CPU writes a 1 to this bit to flush the next packet to be read from the endpoint RX FIFO. The FIFO pointer is reset and the RXRDY bit is cleared. 
Note: Thsi bit should only be set when RXRDY is set. At other times, it may cause data to be corrupted. 
Note: If the FIFO is double-buffered, FLUSH may need to be set twice to completely clear the FIFO.
Note: Device and host mode." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="EFFECT" value="0x1" description="Flushes the next packet to be read from the endpoint receive FIFO. The FIFO pointer is reset and the RXRDY bit is cleared"/>
            </bitfield>
            <bitfield id="STALLREQPKT" description="Send Stall / Request Packet.
Device mode: The CPU writes a 1 to this bit to issue a STALL handshake. The CPU clears this bit to terminate the stall condition. - Note: This bit has no effect where the endpoint is being used for Isochronous transfers.
Host mode: The CPU writes a 1 to this bit to request an IN transaction. It is cleared when RXRDY is set." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLEAR" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Send stall or packet request."/>
            </bitfield>
            <bitfield id="STALLED" description="Sent Stall / RX Stall
Device mode: This bit is set when a STALL handshake is transmitted. The CPU should clear this bit.
Host mode: When a STALL handshake is received, this bit is set and an interrupt is generated. The CPU should clear this bit." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="STALLED_WAIT" value="0x0" description="No handshake has been received."/>
                <bitenum id="STALLED_RECEIVE" value="0x1" description="A STALL handshake has been received. The EPn bit in the USBRXIS register is also set."/>
            </bitfield>
            <bitfield id="CLRDT" description="Clear Data Toggle.
The CPU writes a 1 to this bit to reset the endpoint data toggle to 0.
Note: Device and host mode." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="EFFECT" value="0x1" description="Writing a 1 to this bit clears the DT bit in the USBRXCSRH[n] register."/>
            </bitfield>
        </register>
