ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/USBFS0_1.0.xml
        <register id="USBFS0_RXCSRH" width="8" offset="0x7" description="USB Receive Control and Status Endpoint [n] High">
            <bitfield id="INCOMPRX" description="This bit will be set in a high-bandwidth Isochronous or Interrupt transfer if the packet received is incomplete, because parts of the data were not received. It is cleared when RXRDY is cleared.
Note: In anything other than Isochronous transfer, this bit will always return 0.
Note: Device and host mode." begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="DT" description="Data Toggle.
When read, this bit indicates the current state of the receive data toggle. If DTWE is High, this bit may be written with the required setting of the data toggle. If DTWE is Low, any value written to this bit is ignored. Care should be taken when writing to this bit as it should only be changed to RESET the receive endpoint.
Note: Host mode only." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="LOW" value="0x0" description="Data toggle is low"/>
                <bitenum id="HIGH" value="0x1" description="Data toggle is high"/>
            </bitfield>
            <bitfield id="DTWE" description="Data Toggle Write Enable.
The CPU writes a 1 to this bit to enable the current state of the Endpoint 0 data toggle to be written. This bit is automatically cleared once the new value is written.
Note: Host mode only." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="The DT bit cannot be written."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the current state of the receive endpoint data to be written (see DT bit)."/>
            </bitfield>
            <bitfield id="DMAMOD" description="DMA request mode
The CPU sets this bit to select DMA Request Mode 1 and clears it to select DMA Request Mode 0.
Note: This bit must not be cleared either before or in the same cycle as the above DMAEN bit is cleared.
Note: Device and host mode." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="MODE0" value="0x0" description="An interrupt is generated after every DMA packet transfer."/>
                <bitenum id="MODE1" value="0x1" description="An interrupt is generated only after the entire DMA transfer is complete."/>
            </bitfield>
            <bitfield id="PIDERR" description="PID error
ISO Transactions: The USB controller sets this bit to indicate a PID error in the received packet.
Bulk/Interrupt Transactions: The setting of this bit is ignored.
Note: Device and host mode." begin="4" end="4" width="1" rwaccess="R">
                <bitenum id="NO_ERROR" value="0x0" description="No error"/>
                <bitenum id="ERROR" value="0x1" description="Indicates a PID error in the received packet of an isochronous transaction."/>
            </bitfield>
            <bitfield id="DMAEN" description="DMA Request Enable
The CPU sets this bit to enable the DMA request for the Rx endpoint.
Note: Four TX and four RX endpoints can be connected to the DMA module. If this bit is set for a particular endpoint, the TRIGARX, TRIGBRX, TRIGCRX, or TRIGDRX field in the USB DMA Select (USBDMASEL) register must be programmed correspondingly" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disables the DMA request for the receive endpoint."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the DMA request for the receive endpoint."/>
            </bitfield>
            <bitfield id="ISOAUTORQ" description="Isochronous transfer mode / Auto request.
Device mode: The CPU sets this bit to enable the Rx endpoint for Isochronous transfers, and clears it to enable the Rx endpoint for Bulk/Interrupt transfers.
Host mode: If the CPU sets this bit, the STALLREQPKT bit will be automatically set when the RXRDY bit is cleared. - Note: This bit is automatically cleared when a short packet is received." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No effect"/>
                <bitenum id="ENABLE" value="0x1" description="Sets ISO transfer mode or enables the REQPKT bit to be automatically set when the RXRDY bit is cleared."/>
            </bitfield>
            <bitfield id="AUTOCLR" description="Auto Clear.
If the CPU sets this bit then the RXRDY bit will be automatically cleared when a packet of USBRXMAXP bytes has been unloaded from the RX FIFO. When packets of less than the maximum packet size are unloaded, RXRDY will have to be cleared manually. When using a DMA to unload the RX-FIFO, data is read from the RX-FIFO in 4 byte chunks regardless of the USBRXMAXP setting.
Note: Device and host mode." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="DSIABLE" value="0x0" description="No effect"/>
                <bitenum id="ENABLE" value="0x1" description="Enables the RXRDY bit to be automatically cleared when a packet of USBRXMAXP[n] bytes has been unloaded from the receive FIFO."/>
            </bitfield>
        </register>
        <register id="USBFS0_RXCOUNT" width="16" offset="0x8" description="USB Receive Byte Count Endpoint [n]">
            <bitfield id="COUNT" description="Receive Packet Count indicates the number of bytes in the receive packet." begin="12" end="0" width="13" rwaccess="R">
            </bitfield>
        </register>
        <register id="USBFS0_TXTYPE" width="8" offset="0xA" description="USB Host Transmit Configure Type Endpoint [n]">
            <bitfield id="TEP" description="Target Endpoint Number.
Software must configure this value to the endpoint number contained in the transmit endpoint descriptor returned to the USB controller during Device enumeration." begin="3" end="0" width="4" rwaccess="R/W">
            </bitfield>
            <bitfield id="PROTO" description="Protocol.
Software must configure this bit field to select the required protocol for the transmit endpoint:" begin="5" end="4" width="2" rwaccess="R/W">
                <bitenum id="CTRL" value="0x0" description="Control"/>
                <bitenum id="ISO" value="0x1" description="isochronous"/>
                <bitenum id="BULK" value="0x2" description="Bulk"/>
                <bitenum id="INT" value="0x3" description="Interrupt"/>
            </bitfield>
            <bitfield id="SPEED" description="Operating Speed.
This bit field specifies the operating speed of the target Device:" begin="7" end="6" width="2" rwaccess="R/W">
                <bitenum id="DEFAULT" value="0x0" description="Default. The target is assumed to be using the same connection speed as the USB controller."/>
                <bitenum id="FULL" value="0x2" description="Full speed"/>
                <bitenum id="LOW" value="0x3" description="Low speed"/>
            </bitfield>
        </register>
        <register id="USBFS0_TXINTERVAL" width="8" offset="0xB" description="USB Host Transmit Interval Endpoint [n]">
        </register>
