ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/USBFS0_1.0.xml
        <register id="USBFS0_RXTYPE" width="8" offset="0xC" description="USB Host Configure Receive Type Endpoint [n]">
            <bitfield id="TEP" description="Target Endpoint Number.
Software must configure this value to the endpoint number contained in the transmit endpoint descriptor returned to the USB controller during Device enumeration." begin="3" end="0" width="4" rwaccess="R/W">
            </bitfield>
            <bitfield id="PROTO" description="Protocol.
Software must configure this bit field to select the required protocol for the transmit endpoint:" begin="5" end="4" width="2" rwaccess="R/W">
                <bitenum id="CTRL" value="0x0" description="Control"/>
                <bitenum id="ISO" value="0x1" description="isochronous"/>
                <bitenum id="BULK" value="0x2" description="Bulk"/>
                <bitenum id="INT" value="0x3" description="Interrupt"/>
            </bitfield>
            <bitfield id="SPEED" description="Operating Speed.  #br#This bit field specifies the operating speed of the target Device:" begin="7" end="6" width="2" rwaccess="R/W">
                <bitenum id="DEFAULT" value="0x0" description="Default. The target is assumed to be using the same connection speed as the USB controller."/>
                <bitenum id="FULL" value="0x2" description="Full speed"/>
                <bitenum id="LOW" value="0x3" description="Low speed"/>
            </bitfield>
        </register>
        <register id="USBFS0_RXINTERVAL" width="8" offset="0xD" description="USB Host Receive Polling Interval Endpoint [n]">
        </register>
        <register id="USBFS0_FIFOSZ" width="8" offset="0xF" description="USB TX and RX FIFO Size Endpoint [n]">
            <bitfield id="TXSIZE" description="Returns the configured size of the TX FIFO" begin="3" end="0" width="4" rwaccess="R">
                <bitenum id="BYTES_8" value="0x0" description="FIFO size 8-byte"/>
                <bitenum id="BYTES_16" value="0x1" description="FIFO size 16-byte"/>
                <bitenum id="BYTES_32" value="0x2" description="FIFO size 32-byte"/>
                <bitenum id="BYTES_64" value="0x3" description="FIFO size 64-byte"/>
                <bitenum id="BYTES_128" value="0x4" description="FIFO size 128-byte"/>
                <bitenum id="BYTES_256" value="0x5" description="FIFO size 256-byte"/>
                <bitenum id="BYTES_512" value="0x6" description="FIFO size 512-byte"/>
                <bitenum id="BYTES_1024" value="0x7" description="FIFO size 1024-byte"/>
                <bitenum id="BYTES_2048" value="0x8" description="FIFO size 2048-byte"/>
            </bitfield>
            <bitfield id="RXSIZE" description="Returns the configured size of the RX FIFO" begin="7" end="4" width="4" rwaccess="R">
                <bitenum id="BYTES_8" value="0x0" description="FIFO size 8-byte"/>
                <bitenum id="BYTES_16" value="0x1" description="FIFO size 16-byte"/>
                <bitenum id="BYTES_32" value="0x2" description="FIFO size 32-byte"/>
                <bitenum id="BYTES_64" value="0x3" description="FIFO size 64-byte"/>
                <bitenum id="BYTES_128" value="0x4" description="FIFO size 128-byte"/>
                <bitenum id="BYTES_256" value="0x5" description="FIFO size 256-byte"/>
                <bitenum id="BYTES_512" value="0x6" description="FIFO size 512-byte"/>
                <bitenum id="BYTES_1024" value="0x7" description="FIFO size 1024-byte"/>
                <bitenum id="BYTES_2048" value="0x8" description="FIFO size 2048-byte"/>
            </bitfield>
        </register>
        </group>
    <register id="USBFS0_RQPKTCOUNT" width="32" offset="0x2304" instances="15" instaddr="0x4" description="USB Request Packet Count in Block Transfer Endpoint [n]">
        <bitfield id="COUNT" description="Block Transfer Packet Count sets the number of packets of the size defined by the MAXLOAD bit field that are to be transferred in a block transfer.
Note: This is only used in Host mode when AUTORQ is set. The bit has no effect in Device mode or when AUTORQ is not set." begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="USBFS0_RXDPKTBUFDIS" width="16" offset="0x2340" description="USB Receive Double Packet Buffer Disable">
        <bitfield id="EP1" description="EP1 RX Double Packet Buffer Disable" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP2" description="EP2 RX Double Packet Buffer Disable" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP3" description="EP3 RX Double Packet Buffer Disable" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP4" description="EP4 RX Double Packet Buffer Disable" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP5" description="EP5 RX Double Packet Buffer Disable" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP6" description="EP6 RX Double Packet Buffer Disable" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP7" description="EP7 RX Double Packet Buffer Disable" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
    </register>
    <register id="USBFS0_TXDPKTBUFDIS" width="16" offset="0x2342" description="USB Transmit Double Packet Buffer Disable">
        <bitfield id="EP1" description="EP1 TX Double Packet Buffer Disable" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP2" description="EP2 TX Double Packet Buffer Disable" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP3" description="EP3 TX Double Packet Buffer Disable" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP4" description="EP4 TX Double Packet Buffer Disable" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP5" description="EP5 TX Double Packet Buffer Disable" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP6" description="EP6 TX Double Packet Buffer Disable" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
        <bitfield id="EP7" description="EP7 TX Double Packet Buffer Disable" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disables double-packet buffering."/>
            <bitenum id="ENABLE" value="0x1" description="Enables double-packet buffering."/>
        </bitfield>
    </register>

</module>